mcuxrandall/2.04-Integration/MCXN947_TXST_Peripheral_Integration/device/periph/PERI_INPUTMUX.h
/*! @name CMP2_TRIG - CMP2 Input Connections */
/*! @{ */

#define INPUTMUX_CMP2_TRIG_TRIGIN_MASK           (0x3FU)
#define INPUTMUX_CMP2_TRIG_TRIGIN_SHIFT          (0U)
/*! TRIGIN - CMP2 input trigger
 *  0b000000..PINT PIN_INT0 input is selected
 *  0b000001..PINT PIN_INT4 input is selected
 *  0b000010..SCT0 SCT_OUT4 input is selected
 *  0b000011..SCT0 SCT_OUT5 input is selected
 *  0b000100..SCT0 SCT_OUT8 input is selected
 *  0b000101..CTIMER0_MAT3 input is selected
 *  0b000110..CTIMER1_MAT3 input is selected
 *  0b000111..CTIMER2_MAT3 input is selected
 *  0b001000..CTIMER3_MAT2 input is selected
 *  0b001001..CTIMER4_MAT2 input is selected
 *  0b001010..Reserved
 *  0b001011..Reserved
 *  0b001100..PINT GPIO_INT_BMAT input is selected
 *  0b001101..ADC0_tcomp[2] input is selected
 *  0b001110..ADC1_tcomp[2] input is selected
 *  0b001111..Reserved
 *  0b010000..Reserved
 *  0b010001..PWM0_SM0_MUX_TRIG0/PWM0_SM0_MUX_TRIG1 input is selected
 *  0b010010..PWM0_SM1_MUX_TRIG0/PWM0_SM1_MUX_TRIG1 input is selected
 *  0b010011..PWM0_SM2_MUX_TRIG0/PWM0_SM2_MUX_TRIG1 input is selected
 *  0b010100..PWM0_SM3_MUX_TRIG0/PWM0_SM3_MUX_TRIG1 input is selected
 *  0b010101..PWM1_SM0_MUX_TRIG0/PWM1_SM0_MUX_TRIG1 input is selected
 *  0b010110..PWM1_SM1_MUX_TRIG0/PWM1_SM1_MUX_TRIG1 input is selected
 *  0b010111..PWM1_SM2_MUX_TRIG0/PWM1_SM2_MUX_TRIG1 input is selected
 *  0b011000..PWM1_SM3_MUX_TRIG0/PWM1_SM3_MUX_TRIG1 input is selected
 *  0b011001..QDC0_CMP/POS_MATCH input is selected
 *  0b011010..QDC1_CMP/POS_MATCH input is selected
 *  0b011011..EVTG_OUT0A input is selected
 *  0b011100..EVTG_OUT0B input is selected
 *  0b011101..EVTG_OUT1A input is selected
 *  0b011110..EVTG_OUT1B input is selected
 *  0b011111..EVTG_OUT2A input is selected
 *  0b100000..EVTG_OUT2B input is selected
 *  0b100001..EVTG_OUT3A input is selected
 *  0b100010..EVTG_OUT3B input is selected
 *  0b100011..LPTMR0 input is selected
 *  0b100100..LPTMR1 input is selected
 *  0b100101..GPIO2 Pin Event Trig 0 input is selected
 *  0b100110..GPIO2 Pin Event Trig 1 input is selected
 *  0b100111..GPIO3 Pin Event Trig 0 input is selected
 *  0b101000..GPIO3 Pin Event Trig 1 input is selected
 */
#define INPUTMUX_CMP2_TRIG_TRIGIN(x)             (((uint32_t)(((uint32_t)(x)) << INPUTMUX_CMP2_TRIG_TRIGIN_SHIFT)) & INPUTMUX_CMP2_TRIG_TRIGIN_MASK)
/*! @} */

/*! @name SINC_FILTER_CHN_SINC_FILTER_CH - SINC Filter Channel Trigger Input Connections */
/*! @{ */

#define INPUTMUX_SINC_FILTER_CHN_SINC_FILTER_CH_INP_MASK (0x3FU)
#define INPUTMUX_SINC_FILTER_CHN_SINC_FILTER_CH_INP_SHIFT (0U)
/*! INP - SINC FILTER trigger input connections
 *  0b000000..PINT PIN_INT0 input is selected
 *  0b000001..PINT PIN_INT1 input is selected
 *  0b000010..SCT_OUT4 input is selected
 *  0b000011..SCT_OUT5 input is selected
 *  0b000100..SCT_OUT9 input is selected
 *  0b000101..CTIMER0_MAT3 input is selected
 *  0b000110..CTIMER1_MAT3 input is selected
 *  0b000111..CTIMER2_MAT3 input is selected
 *  0b001000..CTIMER3_MAT3 input is selected
 *  0b001001..CTIMER4_MAT3 input is selected
 *  0b001010..Reserved
 *  0b001011..Reserved
 *  0b001100..PINT GPIO_INT_BMAT input is selected
 *  0b001101..ADC0_tcomp[0] input is selected
 *  0b001110..ADC0_tcomp[1] input is selected
 *  0b001111..ADC0_tcomp[2] input is selected
 *  0b010000..ADC0_tcomp[3] input is selected
 *  0b010001..ADC1_tcomp[0] input is selected
 *  0b010010..ADC1_tcomp[1] input is selected
 *  0b010011..ADC1_tcomp[2] input is selected
 *  0b010100..ADC1_tcomp[3] input is selected
 *  0b010101..CMP0_OUT input is selected
 *  0b010110..CMP1_OUT input is selected
 *  0b010111..CMP2_OUT input is selected
 *  0b011000..PWM0_SM0_MUX_TRIG0 input is selected
 *  0b011001..PWM0_SM0_MUX_TRIG1 input is selected
 *  0b011010..PWM0_SM1_MUX_TRIG0 input is selected
 *  0b011011..PWM0_SM1_MUX_TRIG1 input is selected
 *  0b011100..PWM0_SM2_MUX_TRIG0 input is selected
 *  0b011101..PWM0_SM2_MUX_TRIG1 input is selected
 *  0b011110..PWM0_SM3_MUX_TRIG0 input is selected
 *  0b011111..PWM0_SM3_MUX_TRIG1 input is selected
 *  0b100000..PWM1_SM0_MUX_TRIG0 input is selected
 *  0b100001..PWM1_SM0_MUX_TRIG1 input is selected
 *  0b100010..PWM1_SM1_MUX_TRIG0 input is selected
 *  0b100011..PWM1_SM1_MUX_TRIG1 input is selected
 *  0b100100..PWM1_SM2_MUX_TRIG0 input is selected
 *  0b100101..PWM1_SM2_MUX_TRIG1 input is selected
 *  0b100110..PWM1_SM3_MUX_TRIG0 input is selected
 *  0b100111..PWM1_SM3_MUX_TRIG1 input is selected
 *  0b101000..QDC0_CMP/POS_MATCH input is selected
 *  0b101001..QDC1_CMP/POS_MATCH input is selected
 *  0b101010..EVTG_OUT0A input is selected
 *  0b101011..EVTG_OUT0B input is selected
 *  0b101100..EVTG_OUT1A input is selected
 *  0b101101..EVTG_OUT1B input is selected
 *  0b101110..EVTG_OUT2A input is selected
 *  0b101111..EVTG_OUT2B input is selected
 *  0b110000..EVTG_OUT3A input is selected
 *  0b110001..EVTG_OUT3B input is selected
 *  0b110010..LPTMR0 input is selected
 *  0b110011..LPTMR1 input is selected
 *  0b110100..FlexIO CH0 input is selected
 *  0b110101..FlexIO CH1 input is selected
 *  0b110110..FlexIO CH2 input is selected
 *  0b110111..FlexIO CH3 input is selected
 *  0b111000..WUU input is selected
 */
#define INPUTMUX_SINC_FILTER_CHN_SINC_FILTER_CH_INP(x) (((uint32_t)(((uint32_t)(x)) << INPUTMUX_SINC_FILTER_CHN_SINC_FILTER_CH_INP_SHIFT)) & INPUTMUX_SINC_FILTER_CHN_SINC_FILTER_CH_INP_MASK)
/*! @} */

/* The count of INPUTMUX_SINC_FILTER_CHN_SINC_FILTER_CH */
#define INPUTMUX_SINC_FILTER_CHN_SINC_FILTER_CH_COUNT (5U)

/*! @name OPAMPN_TRIG_OPAMP_TRIG - OPAMP Trigger Input Connections */
/*! @{ */

#define INPUTMUX_OPAMPN_TRIG_OPAMP_TRIG_INP_MASK (0x3FU)
#define INPUTMUX_OPAMPN_TRIG_OPAMP_TRIG_INP_SHIFT (0U)
/*! INP - OPAMP trigger input connections
 *  0b000000..PINT PIN_INT0 input is selected
 *  0b000001..PINT PIN_INT1 input is selected
 *  0b000010..PINT PIN_INT2 input is selected
 *  0b000011..PINT PIN_INT3 input is selected
 *  0b000100..SCT_OUT4 input is selected
 *  0b000101..SCT_OUT5 input is selected
 *  0b000110..SCT_OUT6 input is selected
 *  0b000111..SCT_OUT7 input is selected
 *  0b001000..SCT_OUT8 input is selected
 *  0b001001..CTIMER0_MAT3 input is selected
 *  0b001010..CTIMER1_MAT3 input is selected
 *  0b001011..CTIMER2_MAT3 input is selected
 *  0b001100..CTIMER3_MAT3 input is selected
 *  0b001101..CTIMER4_MAT3 input is selected
 *  0b001110..PINT GPIO_INT_BMAT input is selected
 *  0b001111..ADC0_tcomp[0] input is selected
 *  0b010000..ADC0_tcomp[1] input is selected
 *  0b010001..ADC0_tcomp[2] input is selected
 *  0b010010..ADC0_tcomp[3] input is selected
 *  0b010011..ADC1_tcomp[0] input is selected
 *  0b010100..ADC1_tcomp[1] input is selected
 *  0b010101..ADC1_tcomp[2] input is selected
 *  0b010110..ADC1_tcomp[3] input is selected
 *  0b010111..PWM0_SM0_MUX_TRIG0 input is selected
 *  0b011000..PWM0_SM0_MUX_TRIG1 input is selected
 *  0b011001..PWM0_SM1_MUX_TRIG0 input is selected
 *  0b011010..PWM0_SM1_MUX_TRIG1 input is selected
 *  0b011011..PWM0_SM2_MUX_TRIG0 input is selected
 *  0b011100..PWM0_SM2_MUX_TRIG1 input is selected
 *  0b011101..PWM0_SM3_MUX_TRIG0 input is selected
 *  0b011110..PWM0_SM3_MUX_TRIG1 input is selected
 *  0b011111..PWM1_SM0_MUX_TRIG0 input is selected
 *  0b100000..PWM1_SM0_MUX_TRIG1 input is selected
 *  0b100001..PWM1_SM1_MUX_TRIG0 input is selected
 *  0b100010..PWM1_SM1_MUX_TRIG1 input is selected
 *  0b100011..PWM1_SM2_MUX_TRIG0 input is selected
 *  0b100100..PWM1_SM2_MUX_TRIG1 input is selected
 *  0b100101..PWM1_SM3_MUX_TRIG0 input is selected
 *  0b100110..PWM1_SM3_MUX_TRIG1 input is selected
 *  0b100111..EVTG_OUT0A input is selected
 *  0b101000..EVTG_OUT0B input is selected
 *  0b101001..EVTG_OUT1A input is selected
 *  0b101010..EVTG_OUT1B input is selected
 *  0b101011..EVTG_OUT2A input is selected
 *  0b101100..EVTG_OUT2B input is selected
 *  0b101101..EVTG_OUT3A input is selected
 *  0b101110..EVTG_OUT3B input is selected
 *  0b101111..TRIG_IN0 input is selected
 *  0b110000..TRIG_IN1 input is selected
 *  0b110001..TRIG_IN2 input is selected
 *  0b110010..TRIG_IN3 input is selected
 *  0b110011..FlexIO CH4 input is selected
 *  0b110100..FlexIO CH5 input is selected
 *  0b110101..FlexIO CH6 input is selected
 *  0b110110..FlexIO CH7 input is selected
 */
#define INPUTMUX_OPAMPN_TRIG_OPAMP_TRIG_INP(x)   (((uint32_t)(((uint32_t)(x)) << INPUTMUX_OPAMPN_TRIG_OPAMP_TRIG_INP_SHIFT)) & INPUTMUX_OPAMPN_TRIG_OPAMP_TRIG_INP_MASK)
/*! @} */

